/**
 * 
 * Created by zhouyang on 2017/2/2.
 */

function $$() {
    
}
$$.prototype ={
    
};
var $$ = new $$();



/*运动框架*/
function Animate() {
 
    /*默认值*/
    this.config ={
        
    }
    
    /*用一个对象来保存运动相关的数据*/
    this._obj = {};
    
    /*初始化函数*/
    this._init();
}
Animate.prototype ={

    /* ------------------------------------------------
     *添加部  -- add
     *部门职责描述: 添加元素 以及确定我要对哪个属性做动画
     *-------------------------------------------------*/

    /*用户来调用的方法
     * 用法:
     * div.add(id,('height':500))
     * */
    add :function () {

        this._adapter();
        this._run();
    },

    /*适配器 - 单一职责原则
     * 用来保存运行的基本数据
     * */
    _adapter :function () {

    },

    /*-------------------运行 核心:run-------------------*/
    
    /* run 循环调用loop*/
    _run:function () {
        
    },
    /*循环遍历对象  调用 move*/
    _loop : function () {
        
    },
    /*实现单个物体的运动*/
    _move :function () {
        /*实现单个物体的 单个运动*/
        function oneMove(){
            
        }
    },





    /*-------------------公用部分------------------------*/


    /*--------------------------------------------------
    *  公用API
    *  提供给使用框架的人
    * -------------------------------------------------*/
    

};

$$.animate = new Animate();